app/views/posts/_form.html.erb

SELECT "genres".* FROM "genres"
---
  <fieldset class="form-group">
      <%= collection_check_boxes(:post, :genre_ids, Genre.all, :id, :name) %>

SELECT "platforms".* FROM "platforms"
---
  <fieldset class="form-group">
      <%= collection_check_boxes(:post, :platform_ids, Platform.all, :id, :name) %>