app/views/posts/_post.html.erb


              <h4 class="card-text"><%= post.genres.map{ |x| x.name }.join(", ") %></h4>
              <h4 class="card-text"><%= post.platforms.map { |x| x.name }.join(", ") %></h4>
---
SELECT "genres".* FROM "genres" INNER JOIN "genres_posts" ON "genres"."id" = "genres_posts"."genre_id" WHERE "genres_posts"."post_id" = $1  [["post_id", 1]]
SELECT "platforms".* FROM "platforms" INNER JOIN "platforms_posts" ON "platforms"."id" = "platforms_posts"."platform_id" WHERE "platforms_posts"."post_id" = $1  [["post_id", 1]]