app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("title", "content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Hello "], ["content", "Hello World "], ["user_id", 1], ["post_id", 1], ["created_at", 2016-08-08 13:53:48 UTC], ["updated_at", 2016-08-08 13:53:48 UTC]]
---
  def create
    @post = Post.find_by_id(comment_params[:post_id])
      @comment = current_user.comments.new(comment_params)
      respond_to do |format|
        if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @comment = Comment.find(params[:id])
      @comment.destroy
      respond_to do |format|
        format.html { redirect_to Post.find_by_id(params[:post_id]), notice: 'Comment was successfully destroyed.' }