app/controllers/posts_controller.rb

  def index
    if params[:genre_id]
      @posts = Post.includes(:genres).where(genres: { id: params[:genre_id] })
    elsif params[:platform_id]
      @posts = Post.includes(:platforms).where(platforms: { id: params[:platform_id] })
    else
      @posts = Post.all
---
SELECT "genres".* FROM "genres" INNER JOIN "genres_posts" ON "genres"."id" = "genres_posts"."genre_id" WHERE "genres_posts"."post_id" = $1  [["post_id", 1]]
SELECT "platforms".* FROM "platforms" INNER JOIN "platforms_posts" ON "platforms"."id" = "platforms_posts"."platform_id" WHERE "platforms_posts"."post_id" = $1  [["post_id", 1]]
SELECT "genres".* FROM "genres"
SELECT "platforms".* FROM "platforms"
SELECT "posts".* FROM "posts"

  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("game", "image", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["game", "Bioshock"], ["image", "bioshock.jpg"], ["description", "Big daddy and a little sister"], ["user_id", 7], ["created_at", 2016-08-07 10:47:48 UTC], ["updated_at", 2016-08-07 10:47:48 UTC]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["description", "Arty Farty Mario"], ["updated_at", 2016-08-08 15:50:02 UTC], ["id", 1]]

  def destroy
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]

    def set_post
      @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]