app/controllers/posts_controller.rb

    def set_post
      @post = current_user.posts.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 7], ["id", 2], ["LIMIT", 1]]